### Importing required libraries

In [3]:
import pandas as pd  # For data analysis
import numpy as np   # For mathematical calculations 
import seaborn as sns #Higher version of matplotlib
import matplotlib.pyplot as plt #For data visualization

### Read the data

In [5]:
df_books = pd.read_csv(r'C:\Users\priyanka\Desktop\bda\bdamini\books.csv')
df_book_tags = pd.read_csv(r'C:\Users\priyanka\Desktop\bda\bdamini\book_tags.csv')
df_ratings = pd.read_csv(r'C:\Users\priyanka\Desktop\bda\bdamini\ratings.csv')
df_tags = pd.read_csv(r'C:\Users\priyanka\Desktop\bda\bdamini\tags.csv')

In [7]:
df_books.head()

,id,book_id,best_book_id,work_id,books_count,isbn,isbn13,authors,original_publication_year,original_title,...,ratings_count,work_ratings_count,work_text_reviews_count,ratings_1,ratings_2,ratings_3,ratings_4,ratings_5,image_url,small_image_url
0,1,2767052,2767052,2792775,272,439023483,9.780439e+12,Suzanne Collins,2008.0,The Hunger Games,...,4780653,4942365,155254,66715,127936,560092,1481305,2706317,https://images.gr-assets.com/books/1447303603m...,https://images.gr-assets.com/books/1447303603s...
1,2,3,3,4640799,491,439554934,9.780440e+12,"J.K. Rowling, Mary GrandPré",1997.0,Harry Potter and the Philosopher's Stone,...,4602479,4800065,75867,75504,101676,455024,1156318,3011543,https://images.gr-assets.com/books/1474154022m...,https://images.gr-assets.com/books/1474154022s...
2,3,41865,41865,3212258,226,316015849,9.780316e+12,Stephenie Meyer,2005.0,Twilight,...,3866839,3916824,95009,456191,436802,793319,875073,1355439,https://images.gr-assets.com/books/1361039443m...,https://images.gr-assets.com/books/1361039443s...
3,4,2657,2657,3275794,487,61120081,9.780061e+12,Harper Lee,1960.0,To Kill a Mockingbird,...,3198671,3340896,72586,60427,117415,446835,1001952,1714267,https://images.gr-assets.com/books/1361975680m...,https://images.gr-assets.com/books/1361975680s...
4,5,4671,4671,245494,1356,743273567,9.780743e+12,F. Scott Fitzgerald,1925.0,The Great Gatsby,...,2683664,2773745,51992,86236,197621,606158,936012,947718,https://images.gr-assets.com/books/1490528560m...,https://images.gr-assets.com/books/1490528560s...

In [9]:
df_books.iloc[:,0:10].head()

,id,book_id,best_book_id,work_id,books_count,isbn,isbn13,authors,original_publication_year,original_title
0,1,2767052,2767052,2792775,272,439023483,9.780439e+12,Suzanne Collins,2008.0,The Hunger Games
1,2,3,3,4640799,491,439554934,9.780440e+12,"J.K. Rowling, Mary GrandPré",1997.0,Harry Potter and the Philosopher's Stone
2,3,41865,41865,3212258,226,316015849,9.780316e+12,Stephenie Meyer,2005.0,Twilight
3,4,2657,2657,3275794,487,61120081,9.780061e+12,Harper Lee,1960.0,To Kill a Mockingbird
4,5,4671,4671,245494,1356,743273567,9.780743e+12,F. Scott Fitzgerald,1925.0,The Great Gatsby

In [11]:
df_books.iloc[:,11:16].head()

,language_code,average_rating,ratings_count,work_ratings_count,work_text_reviews_count
0,eng,4.34,4780653,4942365,155254
1,eng,4.44,4602479,4800065,75867
2,en-US,3.57,3866839,3916824,95009
3,eng,4.25,3198671,3340896,72586
4,eng,3.89,2683664,2773745,51992

In [ ]:
df_books.iloc[:,17:23].head()

In [ ]:
df_books.shape

In [ ]:
df_tags.head(2)
print(df_tags.shape)

In [ ]:
df_ratings.head(2)

In [ ]:
df_book_tags.head()

In [ ]:
# Drop the useless columns
df_books = df_books.drop(columns=['id', 'best_book_id', 'work_id', 'isbn', 'isbn13', 'title','work_ratings_count',
                                   'work_text_reviews_count', 'ratings_1', 'ratings_2', 'ratings_3', 'ratings_4', 'ratings_5', 
                                    'image_url','small_image_url'])

In [407]:
df_books.head()

,book_id,books_count,authors,original_publication_year,original_title,language_code,average_rating,ratings_count
0,2767052,272,Suzanne Collins,2008.0,The Hunger Games,eng,4.34,4780653
1,3,491,"J.K. Rowling, Mary GrandPré",1997.0,Harry Potter and the Philosopher's Stone,eng,4.44,4602479
2,41865,226,Stephenie Meyer,2005.0,Twilight,en-US,3.57,3866839
3,2657,487,Harper Lee,1960.0,To Kill a Mockingbird,eng,4.25,3198671
4,4671,1356,F. Scott Fitzgerald,1925.0,The Great Gatsby,eng,3.89,2683664

In [408]:
df_books.shape

(10000, 8)

In [409]:
# Check the nulls
df_books.isna().sum()

book_id                         0
books_count                     0
authors                         0
original_publication_year      21
original_title                585
language_code                1084
average_rating                  0
ratings_count                   0
dtype: int64

In [410]:
# Drop the nulls
df_books= df_books.dropna()

In [411]:
df_books.shape

(8405, 8)

In [412]:
df_ratings.head()

   book_id  user_id  rating
0        1      314       5
1        1      439       3
2        1      588       5
3        1     1169       4
4        1     1185       4

In [413]:
df_ratings=df_ratings.sort_values('user_id')
df_ratings

        book_id  user_id  rating
117889     1180        1       4
488112     4893        1       3
625717     6285        1       4
796318     8034        2       4
875008     8855        2       5
...         ...      ...     ...
912886     9255    53424       4
818162     8262    53424       4
777143     7833    53424       4
716608     7212    53424       4
420762     4214    53424       5

[981756 rows x 3 columns]

In [414]:
# Drop the duplicates
df_ratings=df_ratings.drop_duplicates(subset=(['user_id','rating']))

In [415]:
df_ratings.shape

(153827, 3)

In [416]:
df_books['original_title'].nunique()

8283

In [417]:
#We will consider original_title to classify its repetitive elements as duplicate 
df_books= df_books.drop_duplicates(subset='original_title')

In [418]:
df_books.head()

,book_id,books_count,authors,original_publication_year,original_title,language_code,average_rating,ratings_count
0,2767052,272,Suzanne Collins,2008.0,The Hunger Games,eng,4.34,4780653
1,3,491,"J.K. Rowling, Mary GrandPré",1997.0,Harry Potter and the Philosopher's Stone,eng,4.44,4602479
2,41865,226,Stephenie Meyer,2005.0,Twilight,en-US,3.57,3866839
3,2657,487,Harper Lee,1960.0,To Kill a Mockingbird,eng,4.25,3198671
4,4671,1356,F. Scott Fitzgerald,1925.0,The Great Gatsby,eng,3.89,2683664

In [419]:
df_books.shape

(8283, 8)

In [420]:
df_tags

       tag_id    tag_name
0           0           -
1           1        --1-
2           2       --10-
3           3       --12-
4           4      --122-
...       ...         ...
34247   34247   Ｃhildrens
34248   34248   Ｆａｖｏｒｉｔｅｓ
34249   34249       Ｍａｎｇａ
34250   34250      ＳＥＲＩＥＳ
34251   34251  ｆａｖｏｕｒｉｔｅｓ

[34252 rows x 2 columns]

In [421]:
df_tags= df_tags.drop_duplicates(subset='tag_id')

In [422]:
df_book_tags

        goodreads_book_id  tag_id   count
0                       1   30574  167697
1                       1   11305   37174
2                       1   11557   34173
3                       1    8717   12986
4                       1   33114   12716
...                   ...     ...     ...
999907           33288638   21303       7
999908           33288638   17271       7
999909           33288638    1126       7
999910           33288638   11478       7
999911           33288638   27939       7

[999912 rows x 3 columns]

In [423]:
df_book_tags=df_book_tags.drop_duplicates(subset=['goodreads_book_id', 'tag_id'])

In [424]:
df_book_tags

        goodreads_book_id  tag_id   count
0                       1   30574  167697
1                       1   11305   37174
2                       1   11557   34173
3                       1    8717   12986
4                       1   33114   12716
...                   ...     ...     ...
999907           33288638   21303       7
999908           33288638   17271       7
999909           33288638    1126       7
999910           33288638   11478       7
999911           33288638   27939       7

[999904 rows x 3 columns]

### Data cleaning

In [425]:
def clean_text(text):
    text = str(text).lower()
    text = re.sub('\[.*?\]', '', text)
    text = re.sub('https?://\S+|www\.\S+', '', text)
    text = re.sub('<.*?>+', '', text)
    text = re.sub('[%s]' % re.escape(string.punctuation), '', text)
    text = re.sub('\n', '', text)
    text = re.sub('\w*\d\w*', '', text)
    return text

In [426]:
top_rated_books = df_books.sort_values('average_rating', ascending=False)
top_rated_books

,book_id,books_count,authors,original_publication_year,original_title,language_code,average_rating,ratings_count
3627,24812,14,Bill Watterson,2005.0,The Complete Calvin and Hobbes,eng,4.82,28900
861,17332218,34,Brandon Sanderson,2014.0,Words of Radiance,eng,4.77,73572
8853,95602,6,Francine Rivers,1993.0,Mark of the Lion Trilogy,en-US,4.76,9081
4482,24814,21,Bill Watterson,1996.0,It's a Magical World: A Calvin and Hobbes Coll...,eng,4.75,22351
6360,70489,22,Bill Watterson,1996.0,There's Treasure Everywhere: A Calvin and Hobb...,eng,4.74,16766
...,...,...,...,...,...,...,...,...
8165,23503361,19,Julia Pierpont,2015.0,Parmi les dix milliers de choses,eng,2.84,8458
9020,24929,18,"Gregory Maguire, Douglas Smith",2001.0,Lost,eng,2.80,12534
8006,8664368,45,Howard Jacobson,2010.0,The Finkler Question,eng,2.76,9627
3549,783291,63,Alice Sebold,2007.0,The Almost Moon,eng,2.67,28299
1792,105578,25,Chetan Bhagat,2005.0,One Night @ The Call Center,eng,2.47,40718

In [427]:
# Remove the stopwords
stop_words=set('STOPWORDS')
author_string = " ".join(df_books['authors'])
title_string = " ".join(df_books['original_title'])

## Content Based Recommendation

In [428]:
content_data = df_books[['original_title','authors','average_rating']]
content_data = content_data.astype(str)

In [429]:
df_books.head()

,book_id,books_count,authors,original_publication_year,original_title,language_code,average_rating,ratings_count
0,2767052,272,Suzanne Collins,2008.0,The Hunger Games,eng,4.34,4780653
1,3,491,"J.K. Rowling, Mary GrandPré",1997.0,Harry Potter and the Philosopher's Stone,eng,4.44,4602479
2,41865,226,Stephenie Meyer,2005.0,Twilight,en-US,3.57,3866839
3,2657,487,Harper Lee,1960.0,To Kill a Mockingbird,eng,4.25,3198671
4,4671,1356,F. Scott Fitzgerald,1925.0,The Great Gatsby,eng,3.89,2683664

In [430]:
content_data.head()

,original_title,authors,average_rating
0,The Hunger Games,Suzanne Collins,4.34
1,Harry Potter and the Philosopher's Stone,"J.K. Rowling, Mary GrandPré",4.44
2,Twilight,Stephenie Meyer,3.57
3,To Kill a Mockingbird,Harper Lee,4.25
4,The Great Gatsby,F. Scott Fitzgerald,3.89

In [431]:
content_data['content'] = content_data['original_title'] + ' ' + content_data['authors'] + ' ' + content_data['average_rating']

In [432]:
content_data.head()

,original_title,authors,average_rating,content
0,The Hunger Games,Suzanne Collins,4.34,The Hunger Games Suzanne Collins 4.34
1,Harry Potter and the Philosopher's Stone,"J.K. Rowling, Mary GrandPré",4.44,Harry Potter and the Philosopher's Stone J.K. ...
2,Twilight,Stephenie Meyer,3.57,Twilight Stephenie Meyer 3.57
3,To Kill a Mockingbird,Harper Lee,4.25,To Kill a Mockingbird Harper Lee 4.25
4,The Great Gatsby,F. Scott Fitzgerald,3.89,The Great Gatsby F. Scott Fitzgerald 3.89

In [433]:
content_data['content']

0                   The Hunger Games Suzanne Collins 4.34
1       Harry Potter and the Philosopher's Stone J.K. ...
2                           Twilight Stephenie Meyer 3.57
3                   To Kill a Mockingbird Harper Lee 4.25
4               The Great Gatsby F. Scott Fitzgerald 3.89
                              ...
9994              Billy Budd, Sailor Herman Melville 3.09
9995                        Bayou Moon Ilona Andrews 4.09
9996                 Means of Ascent  Robert A. Caro 4.25
9997           The Mauritius Command Patrick O'Brian 4.35
9998    Cinderella Ate My Daughter: Dispatches from th...
Name: content, Length: 8283, dtype: object

In [434]:
content_data = content_data.reset_index()
indices = pd.Series(content_data.index, index=content_data['original_title'])

In [435]:
content_data = content_data.reset_index()
indices = pd.Series(content_data.index, index=content_data['original_title'])

In [436]:
content_data.head()

,level_0,index,original_title,authors,average_rating,content
0,0,0,The Hunger Games,Suzanne Collins,4.34,The Hunger Games Suzanne Collins 4.34
1,1,1,Harry Potter and the Philosopher's Stone,"J.K. Rowling, Mary GrandPré",4.44,Harry Potter and the Philosopher's Stone J.K. ...
2,2,2,Twilight,Stephenie Meyer,3.57,Twilight Stephenie Meyer 3.57
3,3,3,To Kill a Mockingbird,Harper Lee,4.25,To Kill a Mockingbird Harper Lee 4.25
4,4,4,The Great Gatsby,F. Scott Fitzgerald,3.89,The Great Gatsby F. Scott Fitzgerald 3.89

In [437]:
indices

original_title
The Hunger Games                                                                                0
Harry Potter and the Philosopher's Stone                                                        1
Twilight                                                                                        2
To Kill a Mockingbird                                                                           3
The Great Gatsby                                                                                4
                                                                                             ...
Billy Budd, Sailor                                                                           8278
Bayou Moon                                                                                   8279
Means of Ascent                                                                              8280
The Mauritius Command                                                                        8281
Cinderella Ate My Daughter: Dispatches from the Frontlines of the New Girlie-Girl Culture    8282
Length: 8283, dtype: int64

In [438]:
import re
import string
from sklearn.metrics.pairwise import cosine_similarity
from sklearn.feature_extraction.text import CountVectorizer, TfidfVectorizer
from sklearn.metrics.pairwise import linear_kernel

In [439]:
#removing stopwords
tfidf = TfidfVectorizer(stop_words='english')  
#Term Frequency: This summarizes how often a given word appears within a document.
#Inverse Document Frequency: This downscales words that appear a lot across documents.

#Construct the required TF-IDF matrix by fitting and transforming the data
tfidf_matrix = tfidf.fit_transform(content_data['authors'])

#Output the shape of tfidf_matrix
tfidf_matrix.shape

(8283, 5493)

In [339]:
cosine_sim_author = linear_kernel(tfidf_matrix, tfidf_matrix)

In [340]:
cosine_sim_author[1:10]

array([[0., 1., 0., ..., 0., 0., 0.],
       [0., 0., 1., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [341]:
def get_recommendations_books(title, cosine_sim=cosine_sim_author):
    idx = indices[title]

    # Get the pairwise similarity scores of all books with that book
    sim_scores = list(enumerate(cosine_sim_author[idx]))

    # Sort the books based on the similarity scores
    sim_scores = sorted(sim_scores, key=lambda x: x[1], reverse=True)

    # Get the scores of the 10 most similar books
    sim_scores = sim_scores[1:11]

    # Get the book indices
    book_indices = [i[0] for i in sim_scores]

    # Return the top 10 most similar books
    return list(content_data['original_title'].iloc[book_indices])

In [342]:
def author_book_shows(book):
    for book in book:
        print(book)

In [343]:
books1 = get_recommendations_books(input(), cosine_sim_author)
author_book_shows(books1)

Harry Potter and the Goblet of Fire
Harry Potter and the Order of the Phoenix
Harry Potter and the Chamber of Secrets
Harry Potter and the Goblet of Fire
Harry Potter and the Deathly Hallows
Harry Potter and the Half-Blood Prince
Harry Potter Boxed Set Books 1-4
Harry Potter and the Prisoner of Azkaban
The Casual Vacancy
The Tales of Beedle the Bard
Complete Harry Potter Boxed Set

In [344]:
df_books.columns

Index(['book_id', 'books_count', 'authors', 'original_publication_year',
       'original_title', 'language_code', 'average_rating', 'ratings_count'],
      dtype='object')

In [345]:
df_books['original_title']

0                                        The Hunger Games
1                Harry Potter and the Philosopher's Stone
2                                                Twilight
3                                   To Kill a Mockingbird
4                                        The Great Gatsby
                              ...
9994                                   Billy Budd, Sailor
9995                                           Bayou Moon
9996                                     Means of Ascent
9997                                The Mauritius Command
9998    Cinderella Ate My Daughter: Dispatches from th...
Name: original_title, Length: 8283, dtype: object

In [346]:
'''books1 = get_recommendations_books(input(), cosine_sim_author)
author_book_shows(books1)'''

'books1 = get_recommendations_books(input(), cosine_sim_author)\nauthor_book_shows(books1)'

In [347]:
books3 = get_recommendations_books(input(), cosine_sim_author)
author_book_shows(books3)

The Notebook
A Walk to Remember
Dear John
The Last Song
The Lucky One
Safe Haven
Message in a Bottle
The Rescue
The Guardian
Nights in Rodanthe
A Bend in the Road

## Content Based Filtering On multiple matrix

In [348]:
content_data['content'].head()

0                The Hunger Games Suzanne Collins 4.34
1    Harry Potter and the Philosopher's Stone J.K. ...
2                        Twilight Stephenie Meyer 3.57
3                To Kill a Mockingbird Harper Lee 4.25
4            The Great Gatsby F. Scott Fitzgerald 3.89
Name: content, dtype: object

In [349]:
count = CountVectorizer(stop_words='english')
count_matrix = count.fit_transform(content_data['content'])

cosine_sim_content = cosine_similarity(count_matrix, count_matrix)

In [350]:
cosine_sim_content

array([[1., 0., 0., ..., 0., 0., 0.],
       [0., 1., 0., ..., 0., 0., 0.],
       [0., 0., 1., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 1., 0., 0.],
       [0., 0., 0., ..., 0., 1., 0.],
       [0., 0., 0., ..., 0., 0., 1.]])

In [351]:
def get_recommendations(title, cosine_sim=cosine_sim_content):
    idx = indices[title]

    # Get the pairwsie similarity scores of all books with that book
    sim_scores = list(enumerate(cosine_sim_content[idx]))

    # Sort the books based on the similarity scores
    sim_scores = sorted(sim_scores, key=lambda x: x[1], reverse=True)

    # Get the scores of the 10 most similar books
    sim_scores = sim_scores[1:11]

    # Get the book indices
    book_indices = [i[0] for i in sim_scores]

    # Return the top 10 most similar books
    return list(content_data['original_title'].iloc[book_indices])

In [352]:
def book_shows(book):
    for book in book:
        print(book)

In [290]:
books4 = get_recommendations(input(), cosine_sim_content)
book_shows(books4)

The Da Vinci Code
Inferno
Digital Fortress
Angels & Demons
Deception Point
The Lost Symbol
The Terror
Departure
Brown Bear, Brown Bear, What Do You See?
Encyclopedia Brown, Boy Detective (Encyclopedia Brown, #1)
The Catcher in the Rye

In [291]:
books5 =get_recommendations(input(), cosine_sim_content)
book_shows(books5)

The Catcher in the Rye
Nine Stories
Departure
Franny and Zooey
About a Boy
Flowers in the Attic
We Are Water
Top Secret Twenty-One
The World Without Us
Pompeii
Stray

In [292]:
books5 =get_recommendations(input(), cosine_sim_content)
book_shows(books5)

Flowers in the Attic
The Castle In The Attic (The Castle In The Attic, #1)
If There Be Thorns
Heaven
Departure
Dawn
The Catcher in the Rye
About a Boy
We Are Water
Petals on the Wind
Top Secret Twenty-One